examples/openfoam_airfoil/airfoil_tuner/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1402";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14336
(
0.000703124
0.000728305
0.000750381
0.000769528
0.000786016
0.000800194
0.000812481
0.000823316
...
)
;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 0.00107498;
        value           nonuniform List<scalar> 
224
(
0.00107498
0.00107498
0.00107498
0.00107498
0.00107498
0.00107498
0.00107498
0.00107498
...
)
;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform 0.00107498;
        value           nonuniform List<scalar> 
128
(
0.000703124
0.000703125
0.000703123
0.000703125
0.000703122
0.000703125
0.000703121
0.000703126
...
)
;
    }
    airfoil
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        value           nonuniform List<scalar> 
128
(
4.4265e-08
5.91145e-08
6.50862e-08
6.99554e-08
7.50683e-08
7.9861e-08
8.45795e-08
8.91906e-08
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
